modules/admin/controllers/SitesController.php

SELECT * FROM `Sites` WHERE `site_id`='2'
---
    protected function findModel($id)
    {
        if (($model = Sites::findOne($id)) !== null) {