controllers/ArticleController.php

SELECT * FROM `Articles` WHERE `article_id`='1'
SELECT * FROM `Images` WHERE `article_id`=1
SELECT `Articles`.`article_id`, `Tags`.`tag`, `Tags`.`tag_id` FROM `Articles` LEFT JOIN `Articles_To_Tags` ON Articles.article_id = Articles_To_Tags.article_id LEFT JOIN `Tags` ON Articles_To_Tags.tag_id = Tags.tag_id WHERE Articles.article_id = 1
---
    public function actionView($link) {
        $article = Articles::findOne(['article_id' => $link]);
        $img = Images::findAll(['article_id' => $article->article_id]);
        $tags = (new \yii\db\Query())
                ->select(['Articles.article_id', 'Tags.tag', 'Tags.tag_id'])
                ->from('Articles')
                ->leftJoin('Articles_To_Tags', 'Articles.article_id = Articles_To_Tags.article_id')
                ->leftJoin('Tags', 'Articles_To_Tags.tag_id = Tags.tag_id')
                ->where("Articles.article_id = $article->article_id")
                ->all();