controllers/PostController.php

SELECT * FROM `posts_rss`
---
    public function actionIndex(){
        $model = PostsRss::find()->all();