controllers/SiteController.php

SELECT * FROM `Articles` ORDER BY `article_create_datetime` DESC
---
    public function actionIndex() {
        $articles = \app\models\Articles::find()->orderBy('article_create_datetime desc');
        $categories = \app\models\Category::find()->orderBy('id')->all();

        $pages = new Pagination(['totalCount' => $articles->count(), 'pageSize' => 10, 'pageSizeParam' => false, 'forcePageParam' => false]);