views/site/index.php

        <div class="well">
            <h3><?= $item->title ?></h3>
            <span class="small"><?php echo $item->article_create_datetime ?></span>
        <?php $img = \app\models\Images::find()->select('link_to_image')->where(['article_id' => $item->article_id])->column(); ?>
---
SELECT `link_to_image` FROM `Images` WHERE `article_id`=1